name: "hunyuan3d"
backend: "python"
max_batch_size: 1

input [
  {
    name: "image"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "mesh"
    data_type: TYPE_STRING
    dims: [1]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [ 2 ]
  }
]
