name: "stable_diffusion"
backend: "python"
max_batch_size: 4

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [-1]
  }
]

output [
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [-1]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [ 0 ]
  }
]
